laravel-react-full-stack/routes/web.php

select * from "job_listings"
select * from "job_listings" limit 10 offset 10
select count(*) as aggregate from "job_listings"
---
});


Route::get('/jobs', function () {
    return view('pages.jobs', ['jobs' => JobListing::all()]);
});

Route::get('/jobs/{id}', function ($id) {
    // $job = Arr::first(Job::all(), function ($job) use ($id) {
    //     return $job['id'] === $id;
    // });
    $job = JobListing::find($id);
    return view('pages.job', ['job' => $job]);
});

select * from "languages" limit 11 offset 0
select * from "posts"
---
    return view('language.languages', ['languages' => Language::all()]);
});

Route::get('/languages/{id}', function ($id) {

    // other way to use function and arrow function
    // $language = Arr::first(Language::getAllLanguage(), function ($language) use ($id) {
    //     return $language['id'] === $id;
    // });

    // $language = Arr::first($languages, fn($language) => $language['id'] === $id);
    $language = Language::find($id);
    return view('language.language', ['language' => $language]);
});

// Post area
Route::get('/posts', function () {
    return view('posts.posts', ['posts' => Post::all()]);
});
Route::get("/posts/{id}", function ($id) {
    $post = Post::find($id);
    return view('posts.post', ['post' => $post]);
});